tutorials/migrationPoiseille2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      5;
        nAlphaSubCycles 2;

//        smoothLimiter   0.1;

        implicitPhasePressure yes;
        solver          GAMG;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
        minIter         1;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner	DIC;
        tolerance       1e-10;
        relTol          1e-03;
        maxIter         1000;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
        maxIter 1000;
    }


}

PIMPLE
{
    nOuterCorrectors    10;
    nCorrectors         10;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    
    residualControl
    {
        p_rgh           1e-8;
        "U.*"           1e-8;
        "alpha.*"       1e-8;
    }

}

relaxationFactors
{
    equations
    {

         "U.fluid|U.particles|alpha.fluid|alpha.particles"  0.5;        
         p_rgh        0.2;

         "(U.fluid|U.particles|alpha.fluid|alpha.particles)Final"  1;
         p_rghFinal 1;
    }
}


// ************************************************************************* //
